<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"test-apply apply_apply_error","backend":"6d5a5cc846dabf22ef2c49af6c267393daf24c50577be4ec328b3ddd50a45bc3","plan_job_ref":"Job Test terraform-apply #750 at https://github.com/dflook/terraform-github-actions/actions/runs/15345466068","plan_out_hash":"e21903f6bc6a75270147857cb0ac72a6d913b9b0c4e093eea3c916c3e7334da4","plan_hash":"e435b64272e81fbc262a487f6c1c2d1c1f6a459f80e301ba3236256243dd0b86","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __test-apply apply_apply_error__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
+   resource "aws_s3_bucket" "my_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "hello"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-apply #750](https://github.com/dflook/terraform-github-actions/actions/runs/15345466068)